reddit_clone/app/views/posts/edit.html.erb

SELECT "subs".* FROM "subs"
SELECT "subs"."id" FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 2]]
---
  <input type="hidden" name="authenticity_token" value="<%= form_authenticity_token %>">
  <% Sub.all.each do |sub| %>
    <%= sub.title %><input type="checkbox" name="post[sub_ids][]" value="<%= sub.id %>"
      <%= "checked" if @post.sub_ids.include?(sub.id) %>><br>