reddit_clone/app/views/posts/new.html.erb

SELECT "subs".* FROM "subs"
---
  <input type="hidden" name="authenticity_token" value="<%= form_authenticity_token %>">
  <% Sub.all.each do |sub| %>