reddit_clone/app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.post_id = params[:post_id]
    @comment.author_id = current_user.id
    if params[:parent_comment_id]
      @comment.parent_comment_id = params[:parent_comment_id]
    end
    if @comment.save
---
INSERT INTO "comments" ("content", "author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "sdfasdfsad"], ["author_id", 2], ["post_id", 1], ["created_at", "2018-09-18 21:54:20.581355"], ["updated_at", "2018-09-18 21:54:20.581355"]]