reddit_clone/app/controllers/posts_controller.rb

  def show
    @post = Post.find(params[:id])
    @all_comments = @post.comments.includes(:author)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."author_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["author_id", 2], ["id", 2], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]

  def upvote
    @post = Post.find(params[:id])
    vote = Vote.create!(user_id: current_user.id, votable_id: @post.id, value: 1)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "votes" ("user_id", "value", "votable_id", "votable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 4], ["value", 1], ["votable_id", 1], ["votable_type", "Post"], ["created_at", "2018-09-19 00:03:43.856913"], ["updated_at", "2018-09-19 00:03:43.856913"]]

  def downvote
    @post = Post.find(params[:id])
    vote = Vote.create!(user_id: current_user.id, votable_id: @post.id, value: -1)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "votes" ("user_id", "value", "votable_id", "votable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 4], ["value", -1], ["votable_id", 1], ["votable_type", "Post"], ["created_at", "2018-09-19 00:04:38.489899"], ["updated_at", "2018-09-19 00:04:38.489899"]]

  def update
    @post = current_user.posts.find(params[:id])
    if @post
      if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" INNER JOIN "post_subs" ON "posts"."id" = "post_subs"."post_id" WHERE "post_subs"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "    testtt"], ["updated_at", "2018-09-18 21:33:38.630378"], ["id", 2]]

  def destroy
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    if @post.save
      params[:post][:sub_ids].each do |sub_id|
        PostSub.create!(post_id: @post.id, sub_id: sub_id)
---
INSERT INTO "posts" ("title", "url", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "cool"], ["url", "google.com"], ["sub_id", 1], ["author_id", 2], ["created_at", "2018-09-18 19:10:55.909057"], ["updated_at", "2018-09-18 19:10:55.909057"]]
INSERT INTO "post_subs" ("post_id", "sub_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 2], ["sub_id", 1], ["created_at", "2018-09-18 21:09:13.300441"], ["updated_at", "2018-09-18 21:09:13.300441"]]