reddit_clone/app/views/subs/show.html.erb

SELECT "posts".* FROM "posts" INNER JOIN "post_subs" ON "posts"."id" = "post_subs"."post_id" WHERE "post_subs"."post_id" = $1  [["post_id", 1]]
---
<h2>Posts</h2>
<% @sub.posts.each do |post| %>